<?php
// チームのデータ
// 現在のチームのデータと、過去のチームのデータの登録変更用

// 過去のチームデータの変更(例：JFL降格後に同じ地域の他チームが来た、もしくは降格後にチームカラーを変えた)
// eng_nameはarchiveでは設定必要なし
const Archive_Change_Data=[

      "tochigi"=>[
          "jpn_name"=>"栃木SC",
          "eng_name"=>"tochigi_sc",
      ],

    ];

// 現在のチームデータ(J内部で同じ地域のチームが昇格した場合は、ここで変更できる)
const Team_Data_Lists=[
                // J1
                ["kashima","鹿島","J1",183 ,24,64],
                ["urawa","浦和","J1",231,0,43],
                ["kashiwa","柏","J1",255,241,0],
                ["fc_tokyo","FC東京","J1",33,65,152],
                ["tokyo_v","東京V","J1",3,118,75],
                ["machida","町田","J1",0,35,106],
                ["kawasaki","川崎","J1",53,160,217],
                ["yokohama_fm","横浜FM","J1",0,57,137],
                ["yokohama_fc","横浜FC","J1",0,160,228],
                ["shonan","湘南","J1",103,180,100],
                ["niigata","新潟","J1",255,102,0],
                ["shimizu","清水","J1",250,165,40],
                ["nagoya","名古屋","J1",218,54,27],
                ["kyoto","京都","J1",116,0,107],
                ["g_osaka","G大阪","J1",9,63,166],
                ["c_osaka","C大阪","J1",212,0,105],
                ["kobe","神戸","J1",143,10,31],
                ["okayama","岡山","J1",181,1,62],
                ["hiroshima","広島","J1",80,49,143],
                ["fukuoka","福岡","J1",0,64,127],

                // J2
                ["sapporo","札幌","J2", 215, 0,15],
                ["sendai","仙台","J2",252,204,0],
                ["akita","秋田","J2",0,91,171],
                ["yamagata","山形","J2",15,34,139],
                ["iwaki","いわき","J2",192,23,48],
                ["mito","水戸","J2",29,31,144],
                ["chiba","千葉","J2",254,225,0],
                ["omiya","大宮","J2",245,105,0],
                ["toyama","富山","J2",17,25,135],
                ["kofu","甲府","J2",0,91,172],
                ["iwata","磐田","J2",110,157,211],
                ["fujieda","藤枝","J2",134,52,124],
                ["yamaguchi","山口","J2",235,94,2],
                ["ehime","愛媛","J2",255,102,0],
                ["imabari","今治","J2",23,98,97],
                ["tokushima","徳島","J2",17,17,131],
                ["nagasaki","長崎","J2",243,152,0],
                ["tosu","鳥栖","J2",0,150,210],
                ["kumamoto","熊本","J2",186,26,20],
                ["oita","大分","J2",20,11,140],

                // J3
                ["hachinoe","八戸","J3",20,168,59],
                ["fukushima","福島","J3",230,0,18],
                ["tochigi_sc","栃木SC","J3",245,241,12],
                ["tochigi_c","栃木C","J3",0,41,85],
                ["gunma","群馬","J3",1,62,116],
                ["sagamihara","相模原","J3",39,142,66],
                ["matsumoto","松本","J3",2,61,29],
                ["nagano","長野","J3",235,97,0],
                ["kanazawa","金沢","J3",229,0,9],
                ["numazu","沼津","J3",0,30,179],
                ["gifu","岐阜","J3",0,64,23],
                ["fc_osaka","FC大阪","J3",126,201,240],
                ["nara","奈良","J3",1,29,100],
                ["tottori","鳥取","J3",144,238,144],
                ["sanuki","讃岐","J3",101,170,221],
                ["kochi","高知","J3",184,28,34],
                ["kitakyushu","北九州","J3",255,241,0],
                ["miyazaki","宮崎","J3",255,255,255],
                ["kagoshima","鹿児島","J3",22,51,95],
                ["ryukyu","琉球","J3",152,7,71],
    ];
